In [39]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

In [22]:
ser1 = Series(np.arange(3),index=['A','B','C'])
ser1 = 2*ser1
ser1

A    0
B    2
C    4
dtype: int32

In [23]:
ser1['B']

2

In [24]:
ser1[1]

2

In [25]:
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [26]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [27]:
ser1[ser1>3]

C    4
dtype: int32

In [28]:
ser1[ser1>3] = 10
ser1

A     0
B     2
C    10
dtype: int32

In [29]:
dframe = DataFrame(np.arange(25).reshape([5,5]), index=["NYC",'LA','SF','DC','Chi'], columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [30]:
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [31]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [32]:
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [33]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [34]:
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [37]:
dframe.ix['LA']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [38]:
dframe.ix[1]

AttributeError: 'DataFrame' object has no attribute 'ix'